package com.defrag.redmineplugin.view;

import com.intellij.openapi.project.Project;

import javax.swing.table.DefaultTableModel;
import java.util.Arrays;
import java.util.Vector;

/**
 * Created by defrag on 17.07.17.
 */
public class TasksTableModel extends DefaultTableModel {

    private Project myProject;

    public TasksTableModel() {
        addRow(new Vector<Object>(Arrays.asList(
                "37123",
                "Требуется написать функционал для сверки транзакций",
                "Требуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакций",
                6,
                1.5
        )));
        addRow(new Vector<Object>(Arrays.asList(
                "37123",
                "Требуется написать функционал для сверки транзакций",
                "Требуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакций",
                6,
                1.5
        )));
        addRow(new Vector<Object>(Arrays.asList(
                "37123",
                "Требуется написать функционал для сверки транзакций",
                "Требуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакций",
                6,
                1.5
        )));
        addRow(new Vector<Object>(Arrays.asList(
                "37123",
                "Требуется написать функционал для сверки транзакций",
                "Требуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакций",
                6,
                1.5
        )));
        addRow(new Vector<Object>(Arrays.asList(
                "37123",
                "Требуется написать функционал для сверки транзакций",
                "Требуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакций",
                6,
                1.5
        )));
        addRow(new Vector<Object>(Arrays.asList(
                "37123",
                "Требуется написать функционал для сверки транзакций",
                "Требуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакций",
                6,
                1.5
        )));
        addRow(new Vector<Object>(Arrays.asList(
                "37123",
                "Требуется написать функционал для сверки транзакций",
                "Требуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакций",
                6,
                1.5
        )));addRow(new Vector<Object>(Arrays.asList(
                "37123",
                "Требуется написать функционал для сверки транзакций",
                "Требуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакций",
                6,
                1.5
        )));addRow(new Vector<Object>(Arrays.asList(
                "37123",
                "Требуется написать функционал для сверки транзакций",
                "Требуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакций",
                6,
                1.5
        )));addRow(new Vector<Object>(Arrays.asList(
                "37123",
                "Требуется написать функционал для сверки транзакций",
                "Требуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакций",
                6,
                1.5
        )));addRow(new Vector<Object>(Arrays.asList(
                "37123",
                "Требуется написать функционал для сверки транзакций",
                "Требуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакций",
                6,
                1.5
        )));addRow(new Vector<Object>(Arrays.asList(
                "37123",
                "Требуется написать функционал для сверки транзакций",
                "Требуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакций",
                6,
                1.5
        )));addRow(new Vector<Object>(Arrays.asList(
                "37123",
                "Требуется написать функционал для сверки транзакций",
                "Требуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакций",
                6,
                1.5
        )));addRow(new Vector<Object>(Arrays.asList(
                "37123",
                "Требуется написать функционал для сверки транзакций",
                "Требуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакций",
                6,
                1.5
        )));addRow(new Vector<Object>(Arrays.asList(
                "37123",
                "Требуется написать функционал для сверки транзакций",
                "Требуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакцийТребуется написать функционал для сверки транзакций",
                6,
                1.5
        )));









    }

    public TasksTableModel(Project project) {
        myProject = project;
    }

    @Override
    public Class<?> getColumnClass(int columnIndex) {
        if (columnIndex == 3 || columnIndex == 4)
            return Double.class;
        return String.class;
    }

    @Override
    public int getColumnCount() {
        return 5;
    }

    @Override
    public String getColumnName(int column) {
        switch (column) {
            case 0:
                return "Id";
            case 1:
                return "Author";
            case 2:
                return "Subject";
            case 3:
                return "Estimate";
            case 4:
                return "Remaining";
        }
        return super.getColumnName(column);
    }

    @Override
    public boolean isCellEditable(int row, int column) {
        return false;
    }
}